espruino/Espruino/targetlibs/nrf5x_12/components/nfc/t2t_lib/hal_t2t/hal_nfc_t2t.c
ret_code_t hal_nfc_send(const uint8_t * p_data, size_t data_length)
{
    if (!m_field_on)
    {
        return NRF_ERROR_INVALID_STATE;
    }
    if ((data_length == 0) || (data_length > NFC_BUFFER_SIZE))
    {
        return NRF_ERROR_DATA_SIZE;
    }

    /* Copy data into input and output buffer */
    memcpy(m_nfc_buffer, p_data, NFC_BUFFER_SIZE);

    /* Ignore previous TX END events, SW takes care only for data frames which tranmission is triggered in this function */
    nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

    /* Restore default TX configuration */
    NRF_NFCT->TXD.FRAMECONFIG =   (NFCT_TXD_FRAMECONFIG_PARITY_Parity << NFCT_TXD_FRAMECONFIG_PARITY_Pos)
                                | (NFCT_TXD_FRAMECONFIG_DISCARDMODE_DiscardStart << NFCT_TXD_FRAMECONFIG_DISCARDMODE_Pos)
                                | (NFCT_TXD_FRAMECONFIG_SOF_SoF << NFCT_TXD_FRAMECONFIG_SOF_Pos)
                                | (NFCT_TXD_FRAMECONFIG_CRCMODETX_CRC16TX << NFCT_TXD_FRAMECONFIG_CRCMODETX_Pos);

    NRF_NFCT->PACKETPTR       = (uint32_t) m_nfc_buffer;
    NRF_NFCT->TXD.AMOUNT      = (data_length << NFCT_TXD_AMOUNT_TXDATABYTES_Pos) & NFCT_TXD_AMOUNT_TXDATABYTES_Msk;
    NRF_NFCT->INTENSET        = (NFCT_INTENSET_TXFRAMEEND_Enabled << NFCT_INTENSET_TXFRAMEEND_Pos);
    NRF_NFCT->TASKS_STARTTX   = 1;

    NRF_LOG_INFO("Send\r\n");
    return NRF_SUCCESS;
}

ret_code_t hal_nfc_send_rsp(const uint8_t data, size_t data_length)
{
    if (!m_field_on)
    {
        return NRF_ERROR_INVALID_STATE;
    }

    /* No rx data available, so wait for next frame reception */
    if (data_length == 0)
    {
        NRF_NFCT->TASKS_ENABLERXDATA = 1;
        return NRF_SUCCESS;
    }

    /* Data is sent asynchronously using DMA. */
    static uint8_t buffer[1];
    buffer[0] = data;

    /* Ignore previous TX END events, SW takes care only for data frames which tranmission is triggered in this function */
    nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

    /* Configure peripheral for ACK/NACK */
    NRF_NFCT->TXD.FRAMECONFIG =   (NFCT_TXD_FRAMECONFIG_PARITY_Parity << NFCT_TXD_FRAMECONFIG_PARITY_Pos)
                                | (NFCT_TXD_FRAMECONFIG_DISCARDMODE_DiscardEnd << NFCT_TXD_FRAMECONFIG_DISCARDMODE_Pos)
                                | (NFCT_TXD_FRAMECONFIG_SOF_SoF << NFCT_TXD_FRAMECONFIG_SOF_Pos)
                                | (NFCT_TXD_FRAMECONFIG_CRCMODETX_NoCRCTX << NFCT_TXD_FRAMECONFIG_CRCMODETX_Pos);

    NRF_NFCT->PACKETPTR       = (uint32_t) buffer;
    NRF_NFCT->TXD.AMOUNT      = (data_length << NFCT_TXD_AMOUNT_TXDATABITS_Pos) & NFCT_TXD_AMOUNT_TXDATABITS_Msk;
    NRF_NFCT->INTENSET        = (NFCT_INTENSET_TXFRAMEEND_Enabled << NFCT_INTENSET_TXFRAMEEND_Pos);
    NRF_NFCT->TASKS_STARTTX   = 1;

    NRF_LOG_INFO("Send\r\n");
    return NRF_SUCCESS;
}

ret_code_t hal_nfc_stop(void)
{
    NRF_NFCT->TASKS_DISABLE = 1;

    NRF_LOG_INFO("Stop\r\n");
    return NRF_SUCCESS;
}

ret_code_t hal_nfc_done(void)
{
    m_nfc_lib_callback = (hal_nfc_callback_t) NULL;

    return NRF_SUCCESS;
}

void NFCT_IRQHandler(void)
{
    nfct_field_sense_state_t current_field = NFC_FIELD_STATE_NONE;

    HAL_NFC_DEBUG_PIN_SET(HAL_NFC_NFC_EVENT_DEBUG_PIN);  //DEBUG!

    if (NRF_NFCT->EVENTS_FIELDDETECTED && (NRF_NFCT->INTEN & NFCT_INTEN_FIELDDETECTED_Msk)) 
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_FIELDDETECTED);
        HAL_NFC_DEBUG_PIN_SET(HAL_NFC_DETECT_EVENT_DEBUG_PIN);  //DEBUG!
        current_field = NFC_FIELD_STATE_ON;
        HAL_NFC_DEBUG_PIN_CLEAR(HAL_NFC_DETECT_EVENT_DEBUG_PIN);  //DEBUG!

        NRF_LOG_DEBUG("Field detected\r\n");
    }

#ifndef HAL_NFC_ENGINEERING_BC_FTPAN_WORKAROUND
    if (NRF_NFCT->EVENTS_FIELDLOST && (NRF_NFCT->INTEN & NFCT_INTEN_FIELDLOST_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_FIELDLOST);
        current_field =
           (current_field == NFC_FIELD_STATE_NONE) ? NFC_FIELD_STATE_OFF : NFC_FIELD_STATE_UNKNOWN;

        NRF_LOG_DEBUG("Field lost\r\n");
    }
#endif // HAL_NFC_ENGINEERING_BC_FTPAN_WORKAROUND

    /* Perform actions if any FIELD event is active */
    if (current_field != NFC_FIELD_STATE_NONE)
    {
       nrf_nfct_field_event_handler(current_field);
    }

    if (NRF_NFCT->EVENTS_RXFRAMEEND && (NRF_NFCT->INTEN & NFCT_INTEN_RXFRAMEEND_Msk))
    {
        /* Take into account only number of whole bytes */
        uint32_t rx_data_size = ((NRF_NFCT->RXD.AMOUNT & NFCT_RXD_AMOUNT_RXDATABYTES_Msk) >>
                                 NFCT_RXD_AMOUNT_RXDATABYTES_Pos);

        /* Prevent integer underflow */
        if(rx_data_size >= NFC_CRC_SIZE) rx_data_size -= NFC_CRC_SIZE;

        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_RXFRAMEEND);

        /* Use default FRAMEDELAY, for all cases but callback */
        NRF_NFCT->FRAMEDELAYMAX = 0x1000UL; //302us, taken from datasheet

        /* Frame is garbage, wait for next frame reception */
        if((rx_data_size == 0) || (rx_data_size > NFC_BUFFER_SIZE))
        {
            NRF_NFCT->TASKS_ENABLERXDATA = 1;
        } else
        /* Indicate that SLP_REQ was received - this will cause FRAMEDELAYTIMEOUT error */
        if(m_nfc_buffer[0] == NFC_SLP_REQ_CMD)
        {
            m_slp_req_received = true;

            /* Wait for next frame reception */
            NRF_NFCT->TASKS_ENABLERXDATA = 1;

        } else
        if(m_nfc_lib_callback != NULL)
        {
            /* JS-has a high latency, set relaxed FRAMEDELAY and hope for a forgiving reader */
            NRF_NFCT->FRAMEDELAYMAX = 0xFFFFUL; //4.8ms

            /* This callback should trigger transmission of a Response */
            m_nfc_lib_callback(m_nfc_lib_context,
                               HAL_NFC_EVENT_DATA_RECEIVED,
                               (void*)m_nfc_buffer,
                               rx_data_size);
        }

        NRF_LOG_DEBUG("Rx fend\r\n");
    }

    if (NRF_NFCT->EVENTS_TXFRAMEEND && (NRF_NFCT->INTEN & NFCT_INTEN_TXFRAMEEND_Msk))
    {
        nrf_nfct_event_clear(&NRF_NFCT->EVENTS_TXFRAMEEND);

        /* Disable TX END event to ignore frame transmission other than READ response */
        NRF_NFCT->INTENCLR = (NFCT_INTENCLR_TXFRAMEEND_Clear << NFCT_INTENCLR_TXFRAMEEND_Pos);

        /* Set up for reception */
        NRF_NFCT->PACKETPTR          = (uint32_t) m_nfc_buffer;
        NRF_NFCT->MAXLEN             = NFC_BUFFER_SIZE;
        NRF_NFCT->TASKS_ENABLERXDATA = 1;

        if (m_nfc_lib_callback != NULL)
        {
            m_nfc_lib_callback(m_nfc_lib_context, HAL_NFC_EVENT_DATA_TRANSMITTED, 0, 0);
        }

